/*
 * @Description: 枚举集
 * @Date: 2024-04-22 11:47:28
 * @LastEditTime: 2024-07-02 15:01:39
 */
export * from "./advertisement";
export * from "./member";
export * from "./otc";
export * from "./transaction";

/**
 * 交易类型
 */
export enum TransactionTypeEnum {
  "充值",
  "提现",
  "转账",
  "市币交易",
  "OT买入",
  "0TC卖出",
  "活动奖励",
  "推广奖励",
  "分红",
  "投票",
  "人工充值",
  "空投",
  "活动兑换",
  "CTC买入",
  "CTC卖出",
  "红包发出",
  "红包领取",
  "提现码提现",
  "提现码充值",
  "永续合约手续费",
  "永续合约盈利",
  "永续合约亏损",
  "预测合约失败",
  "预测合约手续费",
  "预测合约奖金",
  "合约返佣",
  "平级奖励",
  "平台手续费收入",
  "币币交易手续费",
  "节点购买",
  "推荐奖励",
  "质押扣除",
  "质押返还",
  "HDC加权奖励",
  "HDZ质押转入",
  "HDZ质押奖励",
  "HDZ质押产出",
  "承兑商保证金缴纳",
  "承兑商保证金赎回",
  "承兑商变现",
  "会议奖励"
}
